_org/_posts/2018-11-11-simple-smtp-server.org
#+TITLE:     Simple And Minimal SMTP Server
#+AUTHOR:    Dashamir Hoxha
#+EMAIL:     dashohoxha@gmail.com
#+DATE:      2018-11-11
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:nil LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
# #+INFOJS_OPT: view:overview toc:t ltoc:t mouse:#aadddd buttons:0 path:js/org-info.js
#+STYLE: <link rel="stylesheet" type="text/css" href="css/org-info.css" />
#+begin_export html
---
layout:     post
title:      Simple And Minimal SMTP Server
date:       2018-11-11

summary: Quite often web applications need to send email notifications.
  For example Moodle needs to notify students and teachers about various
  events. Installing a mail server is not so easy because it needs also
  some DNS and other configurations, in order to do it properly.
  Otherwise the mails that are sent will end up being classified as spam
  and most probably will not reach the recipient. This article describes
  how to build such a mail server.

tags:       postfix smtp server docker docker-script
---
#+end_export

* Introduction

Quite often web applications need to send email notifications. For
example Moodle needs to notify students and teachers about various
events. Without being able to send notifications, Moodle and many
other web applications loose half of their usefulness. On many web
applications you cannot even finish the registration process and
cannot login, unless you verify your email address (the application
sends you an email with a link that you have to click).

To send emails, an application needs to contact by SMTP a local or
remote mail server. Installing a mail server is not so easy because it
needs also some DNS and other configurations, in order to do it
properly, otherwise the mails that are sent will end up being
classified as spam and most probably will not reach the recipient.

A relatively easy solution is to send emails from GMail SMTP servers,
on behalf of the web application. For this you need a GMail account,
which often needs to be different for each application. Managing lots
of gmail accounts is a bit inconvenient. However the biggest problem
is that gmail accounts have a limit on the number of messages that can
be sent each month. For many applications this limit may be OK, but
for some others it is not. For example Moodle typically needs to send
a message for each course subscriber, for each event of the
course. Even for a small Moodle site that does not have many active
courses, the monthly limit can be reached very quickly.

Another alternative is to install your own mail server, and to
configure it properly. This article describes how to do it. The aim of
this mail server is not to be a full-fledged system, where users can
have accounts and use it daily, but just to support web applications
(like Moodle) with sending notifications.


* Sending Email From GMail SMTP Servers

Before starting with building a SMTP server, let's see first the easy
solution, in case this is sufficient for your needs.

1. First install *Simple SMTP*: =apt install ssmtp=

2. You can create a new GMail account or use an existing one. In both
   cases you need to enable the two-factor authentication on the
   google account, and then to create a new application-specific
   password on this account, as described here:
   https://www.lifewire.com/get-a-password-to-access-gmail-by-pop-imap-2-1171882

3. Edit ~/etc/ssmtp/~ and place a content like this:
   #+begin_example
   root=username@gmail.com
   mailhub=smtp.gmail.com:587
   AuthUser=username@gmail.com
   AuthPass=xyzxyzxyzxyzxyzxyz
   UseTLS=YES
   UseSTARTTLS=YES
   rewriteDomain=gmail.com
   hostname=localhost
   FromLineOverride=YES
   #+end_example
   Here =AuthPass= is the app-specific password generated on the step above.

4. Add this line on ~/etc/ssmtp/revaliases~:
   #+begin_example
   root:username@gmail.com:smtp.gmail.com:587
   #+end_example

To test that it works, create and execute a script called ~test-ssmtp.sh~ with a content like this:
#+begin_example
#!/bin/bash -x

recipient=${1:-user@example.org}

cat <<EOF | sendmail -v $recipient
To: $recipient
Subject: Testing ssmtp

Line 1
Line 2
EOF
#+end_example

*Note:* Replace =user@example.org= with your email address or call
the script with your email address as an argument.


* Minimal DNS Configuration

In order to build a mail server you need to own a domain (say
=example.org=) and be able to customize its DNS records.

For each email domain you need something like this on the DNS
configuration:
#+begin_example
; mail for example.org
smtp.example.org.    IN    A           10.11.12.13
example.org.         IN    MX    1     smtp.example.org.
example.org.         IN    TXT         "v=spf1 mx -all"
#+end_example

The first line shows the IP of the server =smtp.example.org=. The second
line shows that the mail server (=MX=) for the domain =example.org= is
=smtp.example.org=. Number =1= shows the priority of the mail server
(since there may be more than one mail servers for the same domain).

The third line basically tells to the other SMTP servers that only
this server is allowed to send emails on behalf of this domain, and no
other servers. This is done to prevent spammers from faking your email
addresses. If a spammer tries to send a mail as if it is coming from
your domain, the SMTP server that is getting this email will consult
this DNS record, will figure out that the server of the spammer is not
allowed to send emails on behalf of =example.org=, and will
immediately classify that email as spam or reject it at all.

*Note:* The configuration lines above are suitable for =bind9= (they
should normally go to =example.org.db=). If you use some other system
for managing your domain records, you should figure out how to do them
properly on it. If you are starting from scratch and don't have yet a
domain for the mail server, I would suggest trying this for managing
its DNS configuration: https://github.com/docker-scripts/bind9

*Note:* On =bind9=, make sure to change the serial number on the
configuration file and then restart the service: =systemctl restart
bind9=. It may take a few hours or a couple of days for the DNS changes
to propagate on the internet.

You can use =dig= to verify that these settings have already been
activated:
#+begin_example
$ dig MX example.org +short
1 smtp.example.org.

$ dig A smtp.example.org +short
10.11.12.13

$ dig TXT example.org +short
"v=spf1 mx -all"
#+end_example


* Build a Postfix Container With Docker-Scripts

It is easy to build a postfix container with docker-scripts.

