_posts/2018-11-11-simple-smtp-server.html
---
layout:     post
title:      Simple And Minimal SMTP Server
date:       2018-11-11

summary: Quite often web applications need to send email notifications.
  For example Moodle needs to notify students and teachers about various
  events. Installing a mail server is not so easy because it needs also
  some DNS and other configurations, in order to do it properly.
  Otherwise the mails that are sent will end up being classified as spam
  and most probably will not reach the recipient. This article describes
  how to build such a mail server.

tags:       postfix smtp server docker docker-script
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-12 Mon 16:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple And Minimal SMTP Server</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">Simple And Minimal SMTP Server</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3703c8d">1. Introduction</a></li>
<li><a href="#org05863dc">2. Sending Email From GMail SMTP Servers</a></li>
<li><a href="#org55421c9">3. Minimal DNS Configuration</a></li>
<li><a href="#org654ffd4">4. Build a Postfix Container With Docker-Scripts</a>
<ul>
<li><a href="#org072df55">4.1. Install Docker-Scripts</a></li>
<li><a href="#org2c2e828">4.2. Install Web-Server Proxy</a></li>
<li><a href="#org304e15e">4.3. Install Postfix</a></li>
<li><a href="#org94b4842">4.4. Activate DKIM Key</a></li>
<li><a href="#orgf4f5cac">4.5. Create a DMARC Record</a></li>
</ul>
</li>
<li><a href="#org1df1616">5. Test the SMTP Server</a></li>
<li><a href="#orgc401ae4">6. Check the Mail Server</a></li>
<li><a href="#org7b38f2b">7. Add Another Email Domain</a></li>
<li><a href="#orgf057fc5">8. Using The SMTP Server</a>
<ul>
<li><a href="#orgf5ae6e2">8.1. Sending Emails From Cron Jobs</a></li>
<li><a href="#orgd44cc76">8.2. Sending Emails From Moodle</a></li>
</ul>
</li>
<li><a href="#orgdcf9243">9. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3703c8d" class="outline-2">
<h2 id="org3703c8d"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Quite often web applications need to send email notifications. For
example Moodle needs to notify students and teachers about various
events. Without being able to send notifications, Moodle and many
other web applications loose half of their usefulness. On many web
applications you cannot even finish the registration process and
cannot login, unless you verify your email address (the application
sends you an email with a link that you have to click).
</p>

<p>
To send emails, an application needs to contact by SMTP a local or
remote mail server. Installing a mail server is not so easy because it
needs also some DNS and other configurations, in order to do it
properly, otherwise the mails that are sent will end up being
classified as spam and most probably will not reach the recipient.
</p>

<p>
A relatively easy solution is to send emails from GMail SMTP servers,
on behalf of the web application. For this you need a GMail account,
which often needs to be different for each application. Managing lots
of gmail accounts is a bit inconvenient. However the biggest problem
is that gmail accounts have a limit on the number of messages that can
be sent each month. For many applications this limit may be OK, but
for some others it is not. For example Moodle typically needs to send
a message for each course subscriber, for each event of the
course. Even for a small Moodle site that does not have many active
courses, the monthly limit can be reached very quickly.
</p>

<p>
Another alternative is to install your own mail server, and to
configure it properly. This article describes how to do it. The aim of
this mail server is not to be a full-fledged system, where users can
have accounts and use it daily, but just to support web applications
(like Moodle) with sending notifications.
</p>
</div>
</div>


<div id="outline-container-org05863dc" class="outline-2">
<h2 id="org05863dc"><span class="section-number-2">2</span> Sending Email From GMail SMTP Servers</h2>
<div class="outline-text-2" id="text-2">
<p>
Before starting with building a SMTP server, let's see first the easy
solution, in case this is sufficient for your needs.
</p>

<ol class="org-ol">
<li>First install <b>Simple SMTP</b>: <code>apt install ssmtp</code></li>

<li>You can create a new GMail account or use an existing one. In both
cases you need to enable the two-factor authentication on the
google account, and then to create a new application-specific
password on this account, as described here:
<a href="https://www.lifewire.com/get-a-password-to-access-gmail-by-pop-imap-2-1171882">https://www.lifewire.com/get-a-password-to-access-gmail-by-pop-imap-2-1171882</a></li>

<li><p>
Edit <code>/etc/ssmtp/</code> and place a content like this:
</p>
<pre class="example">
root=username@gmail.com
mailhub=smtp.gmail.com:587
AuthUser=username@gmail.com
AuthPass=xyzxyzxyzxyzxyzxyz
UseTLS=YES
UseSTARTTLS=YES
rewriteDomain=gmail.com
hostname=localhost
FromLineOverride=YES
</pre>
<p>
Here <code>AuthPass</code> is the app-specific password generated on the step above.
</p></li>

<li><p>
Add this line on <code>/etc/ssmtp/revaliases</code>:
</p>
<pre class="example">
root:username@gmail.com:smtp.gmail.com:587
</pre></li>
</ol>

<p>
To test that it works, create and execute a script called <code>test-ssmtp.sh</code> with a content like this:
</p>
<pre class="example">
#!/bin/bash -x

recipient=${1:-user@example.org}

cat &lt;&lt;EOF | sendmail -v $recipient
To: $recipient
Subject: Testing ssmtp

Line 1
Line 2
EOF
</pre>

<p>
<b>Note:</b> Replace <code>user@example.org</code> with your email address or call
the script with your email address as an argument.
</p>
</div>
</div>


<div id="outline-container-org55421c9" class="outline-2">
<h2 id="org55421c9"><span class="section-number-2">3</span> Minimal DNS Configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
In order to build a mail server you need to own a domain (say
<code>example.org</code>) and be able to customize its DNS records.
</p>

<p>
For each email domain you need something like this on the DNS
configuration:
</p>
<pre class="example">
; mail for example.org
smtp.example.org.    IN    A           10.11.12.13
example.org.         IN    MX    1     smtp.example.org.
example.org.         IN    TXT         "v=spf1 mx -all"
</pre>

<p>
The first line shows the IP of the server <code>smtp.example.org</code>. The second
line shows that the mail server (<code>MX</code>) for the domain <code>example.org</code> is
<code>smtp.example.org</code>. Number <code>1</code> shows the priority of the mail server
(since there may be more than one mail servers for the same domain).
</p>

<p>
The third line basically tells to the other SMTP servers that only
this server is allowed to send emails on behalf of this domain, and no
other servers. This is done to prevent spammers from faking your email
addresses. If a spammer tries to send a mail as if it is coming from
your domain, the SMTP server that is getting this email will consult
this DNS record, will figure out that the server of the spammer is not
allowed to send emails on behalf of <code>example.org</code>, and will
immediately classify that email as spam or reject it at all.
</p>

<p>
<b>Note:</b> The configuration lines above are suitable for <code>bind9</code> (they
should normally go to <code>example.org.db</code>). If you use some other system
for managing your domain records, you should figure out how to do them
properly on it. If you are starting from scratch and don't have yet a
domain for the mail server, I would suggest trying this for managing
its DNS configuration: <a href="https://github.com/docker-scripts/bind9">https://github.com/docker-scripts/bind9</a>
</p>

<p>
<b>Note:</b> On <code>bind9</code>, make sure to change the serial number on the
configuration file and then restart the service: <code>systemctl restart
bind9</code>. It may take a few hours or a couple of days for the DNS changes
to propagate on the internet.
</p>

<p>
You can use <code>dig</code> to verify that these settings have already been
activated:
</p>
<pre class="example">
$ dig MX example.org +short
1 smtp.example.org.

$ dig A smtp.example.org +short
10.11.12.13

$ dig TXT example.org +short
"v=spf1 mx -all"
</pre>
</div>
</div>


<div id="outline-container-org654ffd4" class="outline-2">
<h2 id="org654ffd4"><span class="section-number-2">4</span> Build a Postfix Container With Docker-Scripts</h2>
<div class="outline-text-2" id="text-4">
<p>
It is easy to build a postfix container with docker-scripts.
</p>
</div>
