_org/_posts/2018-11-11-simple-smtp-server.org
** Install Docker-Scripts

#+begin_example
sudo su
apt install m4
git clone https://github.com/docker-scripts/ds /opt/docker-scripts/ds
cd /opt/docker-scripts/ds/
make install
#+end_example

** Install Web-Server Proxy

- Get the scripts: =ds pull wsproxy=
- Create a container directory: =ds init wsproxy @wsproxy=
- Fix the settings: =cd /var/ds/wsproxy/; vim settings.sh=
- Build image, create the container and configure it: =ds make=

We need =wsproxy= to get and manage letsencrypt SSL certificates for the
=postfix= container.

** Install Postfix

- Get the scripts: =ds pull postfix=
- Create a container directory: =ds init postfix @smtp.example.org=
- Fix the settings: =cd /var/ds/smtp.example.org/ ; vim settings.sh=
- Build image, create the container and configure it: =ds make=
- Get a letsencrypt SSL certificate: =ds get-ssl-cert=

** Activate DKIM Key

DKIM keys are used by mail servers to sign the emails that they send,
so that they cannot be changed in transit, and so that it can be
verified that they were sent by them. It is an important tool against
spams and faked emails. If a smtp server signs the messages that it
sends, it is less likely that they will be classified as spam.

Installation scripts generate a DKIM key as well, which is on
~config/dkim-keys/example.org/~.  To activate it you need to add a
record like this on the DNS configuration of the domain:
#+begin_example
mail._domainkey.example.org.  IN  TXT  "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQE....kMJdAwIDAQAB"
#+end_example
You can find the content of the public key on the file:
~config/dkim-keys/example.org/mail.txt~.

Don't forget to update the serial number of the DNS domain and to
restart or reload the service (=systemctl restart bind9=). It may take a
couple of hours or days until these changes are propagated on the
internet.

To check whether it has been activated or not, try the command:
#+begin_example
dig TXT mail._domainkey.example.org +short
#+end_example

** Create a DMARC Record

DMARC is a standard that allows you to set policies on who can send
email for your domain based on DKIM and SPF. For more details see
this: https://postmarkapp.com/support/article/892-what-is-dmarc

You can add a DMARC Record on DNS that will allow you to get weekly
reports from major ISPs about the usage of your email domain.

- Go to http://dmarc.postmarkapp.com/ and add your email address where
  you want to receive reports, and email domain name (=example.org=).

- On the DNS configuration of the domain add a TXT record like this:
  #+begin_example
  _dmarc.example.org.  IN  TXT  "v=DMARC1; p=none; pct=100; rua=mailto:re+x2i0yw1hoq7@dmarc.postmarkapp.com; sp=none; aspf=r;"
  #+end_example
  The value of this TXT record is the one generated by the website
  above.

- To check that it has been activated, try the command:
  #+begin_example
  dig TXT _dmarc.example.org. +short
  #+end_example

* Test the SMTP Server

- Install =swaks=:
  #+begin_example
  cd /var/ds/smtp.example.org/
  ds shell
  apt install swaks
  #+end_example

- Send a test email and check the logs:
  #+begin_example
  swaks --from info@example.org --to admin@example.org -tlso
  tail /var/log/mail.log
  #+end_example
  The option =-tlso= tells it to use TLS if possible.

- Send a test email to a gmail account:
  #+begin_example
  swaks --from info@example.org --to username@gmail.com -tlso
  tail /var/log/mail.log
  #+end_example
  On gmail use "Show original" from the menu, to see the source of the
  received email.

- Try to send a test email from the host (outside the container):
  #+begin_example
  cd /var/ds/smtp.example.org/
  swaks --from info@example.org --to admin@example.org -tlso
  tail /var/log/mail.log
  #+end_example
  It may fail, because the IP of the host may not be on the list of
  the trusted hosts (that are allowed to send email for the domain
  =example.org=). Add it on ~config/trusted_hosts~ and then run =ds inject
  update.sh=. Verify that now you can send emails.

- Try to send email to =test@example.org=:
  #+begin_example
  swaks --from info@example.org --to test@example.org -tlso
  ...
  <** 550 5.1.1 <test@example.org>: Recipient address rejected: User unknown in virtual alias table
  ...
  #+end_example
  It may fail because the recipient does not exist on the alias table.
  On ~config/virtual_alias_maps.cf~ add a line like this:
  #+begin_example
  test@example.org  username@gmail.com
  #+end_example
  Then update the alias db: =ds exec postmap
  /host/config/virtual_alias_maps.cf= (or =ds inject update.sh=).
  Verify that now you can send emails to this address.

- Send an email to =check-auth@verifier.port25.com=:
  #+begin_example
  swaks --from info@example.org --to check-auth@verifier.port25.com \
        --server smtp.example.org -tlso
  #+end_example
  The automatic reply will give you important information about the
  status and health of your email server (for example whether the
  mails sent from it pass the SPF and DKIM checks, whether they are
  considered spam or not, etc.)

- Go to https://www.mail-tester.com/ and send a message to the email
  address displayed there, like this:
  #+begin_example
  swaks --from info@example.org --to test-1p4f6@mail-tester.com \
        --server smtp.example.org -tlso
  #+end_example
  Then click the button for checking the score.

*Note:* Another way to send test emails (instead of =swaks=) is by using
=curl= and a script =testmail.sh= with a content like this:
#+begin_example
#!/bin/bash

from_address='info@example.org'
to_address='admin@example.org'
cat << EOF | curl -v --ssl --upload-file - \
                  --url 'smtp://smtp.example.org' \
                  --mail-from $from_address \
                  --mail-rcpt $to_address
From: $from_address
To: $to_address
Subject: test $(date)

Test message.
EOF
#+end_example


* Check the Mail Server

There are lots of tools and websites that help to check the
configuration of a mail server (DNS settings, configuration, security
features, etc.) These are some of them:

- https://ns.tools

- https://mxtoolbox.com/

- https://app.dmarcanalyzer.com
  + https://app.dmarcanalyzer.com/dns/spf?simple=1
  + https://app.dmarcanalyzer.com/dns/dkim?simple=1
  + https://app.dmarcanalyzer.com/dns/dmarc_validator

- https://github.com/drwetter/testssl.sh/
  #+begin_example
  git clone --depth 1 https://github.com/drwetter/testssl.sh.git
  cd testssl.sh/
  ./testssl.sh -t smtp smtp.example.org:25
  #+end_example


