_posts/2018-11-11-simple-smtp-server.html

<div id="outline-container-org072df55" class="outline-3">
<h3 id="org072df55"><span class="section-number-3">4.1</span> Install Docker-Scripts</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="example">
sudo su
apt install m4
git clone https://github.com/docker-scripts/ds /opt/docker-scripts/ds
cd /opt/docker-scripts/ds/
make install
</pre>
</div>
</div>

<div id="outline-container-org2c2e828" class="outline-3">
<h3 id="org2c2e828"><span class="section-number-3">4.2</span> Install Web-Server Proxy</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Get the scripts: <code>ds pull wsproxy</code></li>
<li>Create a container directory: <code>ds init wsproxy @wsproxy</code></li>
<li>Fix the settings: <code>cd /var/ds/wsproxy/; vim settings.sh</code></li>
<li>Build image, create the container and configure it: <code>ds make</code></li>
</ul>

<p>
We need <code>wsproxy</code> to get and manage letsencrypt SSL certificates for the
<code>postfix</code> container.
</p>
</div>
</div>

<div id="outline-container-org304e15e" class="outline-3">
<h3 id="org304e15e"><span class="section-number-3">4.3</span> Install Postfix</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Get the scripts: <code>ds pull postfix</code></li>
<li>Create a container directory: <code>ds init postfix @smtp.example.org</code></li>
<li>Fix the settings: <code>cd /var/ds/smtp.example.org/ ; vim settings.sh</code></li>
<li>Build image, create the container and configure it: <code>ds make</code></li>
<li>Get a letsencrypt SSL certificate: <code>ds get-ssl-cert</code></li>
</ul>
</div>
</div>

<div id="outline-container-org94b4842" class="outline-3">
<h3 id="org94b4842"><span class="section-number-3">4.4</span> Activate DKIM Key</h3>
<div class="outline-text-3" id="text-4-4">
<p>
DKIM keys are used by mail servers to sign the emails that they send,
so that they cannot be changed in transit, and so that it can be
verified that they were sent by them. It is an important tool against
spams and faked emails. If a smtp server signs the messages that it
sends, it is less likely that they will be classified as spam.
</p>

<p>
Installation scripts generate a DKIM key as well, which is on
<code>config/dkim-keys/example.org/</code>.  To activate it you need to add a
record like this on the DNS configuration of the domain:
</p>
<pre class="example">
mail._domainkey.example.org.  IN  TXT  "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQE....kMJdAwIDAQAB"
</pre>
<p>
You can find the content of the public key on the file:
<code>config/dkim-keys/example.org/mail.txt</code>.
</p>

<p>
Don't forget to update the serial number of the DNS domain and to
restart or reload the service (<code>systemctl restart bind9</code>). It may take a
couple of hours or days until these changes are propagated on the
internet.
</p>

<p>
To check whether it has been activated or not, try the command:
</p>
<pre class="example">
dig TXT mail._domainkey.example.org +short
</pre>
</div>
</div>

<div id="outline-container-orgf4f5cac" class="outline-3">
<h3 id="orgf4f5cac"><span class="section-number-3">4.5</span> Create a DMARC Record</h3>
<div class="outline-text-3" id="text-4-5">
<p>
DMARC is a standard that allows you to set policies on who can send
email for your domain based on DKIM and SPF. For more details see
this: <a href="https://postmarkapp.com/support/article/892-what-is-dmarc">https://postmarkapp.com/support/article/892-what-is-dmarc</a>
</p>

<p>
You can add a DMARC Record on DNS that will allow you to get weekly
reports from major ISPs about the usage of your email domain.
</p>

<ul class="org-ul">
<li>Go to <a href="http://dmarc.postmarkapp.com/">http://dmarc.postmarkapp.com/</a> and add your email address where
you want to receive reports, and email domain name (<code>example.org</code>).</li>

<li><p>
On the DNS configuration of the domain add a TXT record like this:
</p>
<pre class="example">
_dmarc.example.org.  IN  TXT  "v=DMARC1; p=none; pct=100; rua=mailto:re+x2i0yw1hoq7@dmarc.postmarkapp.com; sp=none; aspf=r;"
</pre>
<p>
The value of this TXT record is the one generated by the website
above.
</p></li>

<li><p>
To check that it has been activated, try the command:
</p>
<pre class="example">
dig TXT _dmarc.example.org. +short
</pre></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1df1616" class="outline-2">
<h2 id="org1df1616"><span class="section-number-2">5</span> Test the SMTP Server</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><p>
Install <code>swaks</code>:
</p>
<pre class="example">
cd /var/ds/smtp.example.org/
ds shell
apt install swaks
</pre></li>

<li><p>
Send a test email and check the logs:
</p>
<pre class="example">
swaks --from info@example.org --to admin@example.org -tlso
tail /var/log/mail.log
</pre>
<p>
The option <code>-tlso</code> tells it to use TLS if possible.
</p></li>

<li><p>
Send a test email to a gmail account:
</p>
<pre class="example">
swaks --from info@example.org --to username@gmail.com -tlso
tail /var/log/mail.log
</pre>
<p>
On gmail use "Show original" from the menu, to see the source of the
received email.
</p></li>

<li><p>
Try to send a test email from the host (outside the container):
</p>
<pre class="example">
cd /var/ds/smtp.example.org/
swaks --from info@example.org --to admin@example.org -tlso
tail /var/log/mail.log
</pre>
<p>
It may fail, because the IP of the host may not be on the list of
the trusted hosts (that are allowed to send email for the domain
<code>example.org</code>). Add it on <code>config/trusted_hosts</code> and then run <code>ds inject
  update.sh</code>. Verify that now you can send emails.
</p></li>

<li><p>
Try to send email to <code>test@example.org</code>:
</p>
<pre class="example">
swaks --from info@example.org --to test@example.org -tlso
...
&lt;** 550 5.1.1 &lt;test@example.org&gt;: Recipient address rejected: User unknown in virtual alias table
...
</pre>
<p>
It may fail because the recipient does not exist on the alias table.
On <code>config/virtual_alias_maps.cf</code> add a line like this:
</p>
<pre class="example">
test@example.org  username@gmail.com
</pre>
<p>
Then update the alias db: <code>ds exec postmap
  /host/config/virtual_alias_maps.cf</code> (or <code>ds inject update.sh</code>).
Verify that now you can send emails to this address.
</p></li>

<li><p>
Send an email to <code>check-auth@verifier.port25.com</code>:
</p>
<pre class="example">
swaks --from info@example.org --to check-auth@verifier.port25.com \
      --server smtp.example.org -tlso
</pre>
<p>
The automatic reply will give you important information about the
status and health of your email server (for example whether the
mails sent from it pass the SPF and DKIM checks, whether they are
considered spam or not, etc.)
</p></li>

<li><p>
Go to <a href="https://www.mail-tester.com/">https://www.mail-tester.com/</a> and send a message to the email
address displayed there, like this:
</p>
<pre class="example">
swaks --from info@example.org --to test-1p4f6@mail-tester.com \
      --server smtp.example.org -tlso
</pre>
<p>
Then click the button for checking the score.
</p></li>
</ul>

<p>
<b>Note:</b> Another way to send test emails (instead of <code>swaks</code>) is by using
<code>curl</code> and a script <code>testmail.sh</code> with a content like this:
</p>
<pre class="example">
#!/bin/bash

from_address='info@example.org'
to_address='admin@example.org'
cat &lt;&lt; EOF | curl -v --ssl --upload-file - \
                  --url 'smtp://smtp.example.org' \
                  --mail-from $from_address \
                  --mail-rcpt $to_address
From: $from_address
To: $to_address
Subject: test $(date)

Test message.
EOF
</pre>
</div>
</div>


<div id="outline-container-orgc401ae4" class="outline-2">
<h2 id="orgc401ae4"><span class="section-number-2">6</span> Check the Mail Server</h2>
<div class="outline-text-2" id="text-6">
<p>
There are lots of tools and websites that help to check the
configuration of a mail server (DNS settings, configuration, security
features, etc.) These are some of them:
</p>

<ul class="org-ul">
<li><a href="https://ns.tools/">https://ns.tools/</a></li>

<li><a href="https://mxtoolbox.com/">https://mxtoolbox.com/</a></li>

<li><a href="https://app.dmarcanalyzer.com/">https://app.dmarcanalyzer.com/</a>
<ul class="org-ul">
<li><a href="https://app.dmarcanalyzer.com/dns/spf?simple=1">https://app.dmarcanalyzer.com/dns/spf?simple=1</a></li>
<li><a href="https://app.dmarcanalyzer.com/dns/dkim?simple=1">https://app.dmarcanalyzer.com/dns/dkim?simple=1</a></li>
<li><a href="https://app.dmarcanalyzer.com/dns/dmarc_validator">https://app.dmarcanalyzer.com/dns/dmarc_validator</a></li>
</ul></li>

<li><p>
<a href="https://github.com/drwetter/testssl.sh/">https://github.com/drwetter/testssl.sh/</a>
</p>
<pre class="example">
git clone --depth 1 https://github.com/drwetter/testssl.sh.git
cd testssl.sh/
./testssl.sh -t smtp smtp.example.org:25
</pre></li>
</ul>
</div>
</div>
