_org/_posts/2018-11-11-simple-smtp-server.org
* Add Another Email Domain

The same smtp server can support more than one mail domains. If we
want to add another mail domain, for example =example.com=, we have to
do these:

- Edit ~config/virtual_alias_domains~ and add the domain on a new line.

- Edit ~config/virtual_alias_maps.cf~ and add new email aliases (for
  =postmamster@example.com=, =root@example.com=, =admin@example.com=,
  =info@example.com=, etc.)

- Update server configuration with =ds inject update.sh=, or:
  #+begin_example
  ds exec postmap /host/config/virtual_alias_maps.cf
  ds exec postfix reload
  #+end_example

- Generate a DKIM key for the domain: =ds dkimkey add example.com=

- Go to http://dmarc.postmarkapp.com/ and generate a DMARC record for
  the new domain.

- Update the DNS configuration with records like these:
  #+begin_example
  ; mail for example.com
  example.com.    IN    MX    1    smtp.example.org.

  example.com.                  IN  TXT  "v=spf1 mx -all"
  mail._domainkey.example.com.  IN  TXT  "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQE....kMJdAwIDAQAB"
  _dmarc.example.com.           IN  TXT  "v=DMARC1; p=none; pct=100; rua=mailto:re+x2i0yw1hoq7@dmarc.postmarkapp.com; sp=none; aspf=r;"
  #+end_example
  Note that:
  + The MX record has the same SMTP server as the primary domain:
    =smtp.example.org= (not the new domain =smtp.example.com=).
  + The value of the key for the DKIM record can be found on the file:
    ~config/dkim-keys/example.com/mail.txt~
  + The value of the DMARC record is the one obtained on the previous
    step.
  You can check these DNS configurations like this:
  #+begin_example
  dig mx  example.com. +short
  dig txt example.com. +short
  dig txt mail._domainkey.example.com. +short
  dig txt _dmarc.example.com. +short
  #+end_example


* Using The SMTP Server

Different applications have different methods for configuring the SMTP
server. Let's see how to send emails from cron jobs and from Moodle.

*Important:* For this to work, the IP of the application server should
be on the list ~config/trusted_hosts~ on the smtp server, otherwise it
will refuse to accept and send emails. After adding it on this list,
run =ds inject update.sh= to update the configuration of the mail
server.

** Sending Emails From Cron Jobs

Cron jobs (for example =logwatch=) send emails to =root= through
=sendmail=. We can make it work with =ssmtp=. First install it with: =apt
install ssmtp=.  Then edit ~/etc/ssmtp/ssmtp.conf~ like this:
#+begin_example
mailhub=smtp.example.org
rewriteDomain=example.org
UseSTARTTLS=YES
FromLineOverride=YES
#+end_example
Test it with: =echo test | sendmail -v root=


** Sending Emails From Moodle

If we search for =smtp= on the GUI menu for administration, we will find
that the place for SMTP configuration is on =Dashboard > Site
administration > Server > Email > Outgoing mail configuration= (or on
the location: =/admin/settings.php?section=outgoingmailconfig=).

But we can also configure Moodle from command line, like this:
#+begin_example
moosh config-set smtphosts smtp.example.org
moosh config-set smtpsecure TLS
moosh config-set smtpauthtype PLAIN
moosh config-set smtpuser ''
moosh config-set smtppass ''
moosh config-set smtpmaxbulk 100
#+end_example


* References

- https://www.linux.com/learn/how-set-virtual-domains-and-virtual-users-postfix
- https://tecadmin.net/send-email-smtp-server-linux-command-line-ssmtp/
- https://blog.kruyt.org/postfix-and-tls-encryption/
- https://www.linuxbabe.com/mail-server/setting-up-dkim-and-spf
- https://tecadmin.net/setup-dkim-with-postfix-on-ubuntu-debian/
- https://www.skelleton.net/2015/03/21/how-to-eliminate-spam-and-protect-your-name-with-dmarc/
