_posts/2018-11-11-simple-smtp-server.html


<div id="outline-container-org7b38f2b" class="outline-2">
<h2 id="org7b38f2b"><span class="section-number-2">7</span> Add Another Email Domain</h2>
<div class="outline-text-2" id="text-7">
<p>
The same smtp server can support more than one mail domains. If we
want to add another mail domain, for example <code>example.com</code>, we have to
do these:
</p>

<ul class="org-ul">
<li>Edit <code>config/virtual_alias_domains</code> and add the domain on a new line.</li>

<li>Edit <code>config/virtual_alias_maps.cf</code> and add new email aliases (for
<code>postmamster@example.com</code>, <code>root@example.com</code>, <code>admin@example.com</code>,
<code>info@example.com</code>, etc.)</li>

<li><p>
Update server configuration with <code>ds inject update.sh</code>, or:
</p>
<pre class="example">
ds exec postmap /host/config/virtual_alias_maps.cf
ds exec postfix reload
</pre></li>

<li>Generate a DKIM key for the domain: <code>ds dkimkey add example.com</code></li>

<li>Go to <a href="http://dmarc.postmarkapp.com/">http://dmarc.postmarkapp.com/</a> and generate a DMARC record for
the new domain.</li>

<li><p>
Update the DNS configuration with records like these:
</p>
<pre class="example">
; mail for example.com
example.com.    IN    MX    1    smtp.example.org.

example.com.                  IN  TXT  "v=spf1 mx -all"
mail._domainkey.example.com.  IN  TXT  "v=DKIM1; h=sha256; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQE....kMJdAwIDAQAB"
_dmarc.example.com.           IN  TXT  "v=DMARC1; p=none; pct=100; rua=mailto:re+x2i0yw1hoq7@dmarc.postmarkapp.com; sp=none; aspf=r;"
</pre>
<p>
Note that:
</p>
<ul class="org-ul">
<li>The MX record has the same SMTP server as the primary domain:
<code>smtp.example.org</code> (not the new domain <code>smtp.example.com</code>).</li>
<li>The value of the key for the DKIM record can be found on the file:
<code>config/dkim-keys/example.com/mail.txt</code></li>
<li>The value of the DMARC record is the one obtained on the previous
step.</li>
</ul>
<p>
You can check these DNS configurations like this:
</p>
<pre class="example">
dig mx  example.com. +short
dig txt example.com. +short
dig txt mail._domainkey.example.com. +short
dig txt _dmarc.example.com. +short
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-orgf057fc5" class="outline-2">
<h2 id="orgf057fc5"><span class="section-number-2">8</span> Using The SMTP Server</h2>
<div class="outline-text-2" id="text-8">
<p>
Different applications have different methods for configuring the SMTP
server. Let's see how to send emails from cron jobs and from Moodle.
</p>

<p>
<b>Important:</b> For this to work, the IP of the application server should
be on the list <code>config/trusted_hosts</code> on the smtp server, otherwise it
will refuse to accept and send emails. After adding it on this list,
run <code>ds inject update.sh</code> to update the configuration of the mail
server.
</p>
</div>

<div id="outline-container-orgf5ae6e2" class="outline-3">
<h3 id="orgf5ae6e2"><span class="section-number-3">8.1</span> Sending Emails From Cron Jobs</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Cron jobs (for example <code>logwatch</code>) send emails to <code>root</code> through
<code>sendmail</code>. We can make it work with <code>ssmtp</code>. First install it with: <code>apt
install ssmtp</code>.  Then edit <code>/etc/ssmtp/ssmtp.conf</code> like this:
</p>
<pre class="example">
mailhub=smtp.example.org
rewriteDomain=example.org
UseSTARTTLS=YES
FromLineOverride=YES
</pre>
<p>
Test it with: <code>echo test | sendmail -v root</code>
</p>
</div>
</div>


<div id="outline-container-orgd44cc76" class="outline-3">
<h3 id="orgd44cc76"><span class="section-number-3">8.2</span> Sending Emails From Moodle</h3>
<div class="outline-text-3" id="text-8-2">
<p>
If we search for <code>smtp</code> on the GUI menu for administration, we will find
that the place for SMTP configuration is on <code>Dashboard &gt; Site
administration &gt; Server &gt; Email &gt; Outgoing mail configuration</code> (or on
the location: <code>/admin/settings.php?section=outgoingmailconfig</code>).
</p>

<p>
But we can also configure Moodle from command line, like this:
</p>
<pre class="example">
moosh config-set smtphosts smtp.example.org
moosh config-set smtpsecure TLS
moosh config-set smtpauthtype PLAIN
moosh config-set smtpuser ''
moosh config-set smtppass ''
moosh config-set smtpmaxbulk 100
</pre>
</div>
</div>
</div>


<div id="outline-container-orgdcf9243" class="outline-2">
<h2 id="orgdcf9243"><span class="section-number-2">9</span> References</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="https://www.linux.com/learn/how-set-virtual-domains-and-virtual-users-postfix">https://www.linux.com/learn/how-set-virtual-domains-and-virtual-users-postfix</a></li>
<li><a href="https://tecadmin.net/send-email-smtp-server-linux-command-line-ssmtp/">https://tecadmin.net/send-email-smtp-server-linux-command-line-ssmtp/</a></li>
<li><a href="https://blog.kruyt.org/postfix-and-tls-encryption/">https://blog.kruyt.org/postfix-and-tls-encryption/</a></li>
<li><a href="https://www.linuxbabe.com/mail-server/setting-up-dkim-and-spf">https://www.linuxbabe.com/mail-server/setting-up-dkim-and-spf</a></li>
<li><a href="https://tecadmin.net/setup-dkim-with-postfix-on-ubuntu-debian/">https://tecadmin.net/setup-dkim-with-postfix-on-ubuntu-debian/</a></li>
<li><a href="https://www.skelleton.net/2015/03/21/how-to-eliminate-spam-and-protect-your-name-with-dmarc/">https://www.skelleton.net/2015/03/21/how-to-eliminate-spam-and-protect-your-name-with-dmarc/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-11-11</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2018-11-12 Mon 16:13</p>
<p class="validation"></p>
</div>
</body>
</html>
